import { Injectable } from '@nestjs/common';

@Injectable()
export class AppService {
  getHello(): any {
    return {
      admin: 'admin',
      หัวหน้าสำนักงาน: 'หัวหน้าสำนักงาน',
      พนักงาน: 'พนักงาน',
      คณบดี: 'คณบดี',
      คณบดีฝ่ายยุทธศาสตร์และพัฒนาองค์กร: 'คณบดีฝ่ายยุทธศาสตร์และพัฒนาองค์กร',
      รองคณบดีฝ่ายวิชาการ: 'รองคณบดีฝ่ายวิชาการ',
      รองคณบดีฝ่ายวิจัยและนวัตถกรรม: 'รองคณบดีฝ่ายวิจัยและนวัตถกรรม',
      รองคณบดีฝ่ายคุณภาพนิสิต: 'รองคณบดีฝ่ายคุณภาพนิสิต',
    };
  }
}
